# Edge Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EdgeEndPoint..::..Edge Property
EdgeEndPoint Class See Also
---
The Edge.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public Edge Edge { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Edge As Edge
	Get
```

Visual C++
---
```text
public:
property Edge^ Edge {
	Edge^ get ();
}
```

# See Also
EdgeEndPoint Class
Autodesk.Revit.DB Namespace